Repository: layidavids/gh-actions-course
Catalog: theme/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Server Error (500)
fr: Erreur de serveur (500)

source: Oops, an unexpected error has occured!
fr: Oups, une erreur inattendue s'est produite !

source: Please try again sometime later.
fr: Veuillez réessayer plus tard.

source: Go back to the homepage
fr: Retourner à la page d'accueil

source: settings
fr: paramètres

source: This work is free to use, copy, and distribute without restriction.
fr: Cette œuvre peut être utilisée, copiée et distribuée librement sans restriction.

source: Support
fr: soutien

source: Downloads
fr: Téléchargements

source: Back
fr: Dos

source: Next
fr: Suivant

source: Result
fr: Résultat

source: The Cryptography
fr: L'atelier

source: Workshop.
fr: de cryptographie

source: Your cryptography tooklit, simplified!
fr: Votre cryptographie prend vie, simplifiée!

source: Keys
fr: Clés

source: Generated
fr: Généré

source: Reconstructed | Split
fr: Reconstruit | Diviser

source: Data Contents
fr: Contenu des données

source: Encrypted | Decrypted
fr: Cryptage | Décryptage

source: Token Generation
fr: génération de jetons

source: Keys | Passwords | URL-strings
fr: Clés | Mots de passe | chaînes d'URL

source: Key Shares
fr: divisions clés

source: Splitting | Reconstruction
fr: Fractionnement | Reconstruction

source: Data Protection
fr: Protection des données

source: Encryption | Decryption
fr: Cryptage | Décryptage

source: Sample Key Ceremony
fr: Exemple de cérémonie de remise des clés

source: Automate key creation
fr: Automatiser la création de clés

source: Key Sharing
fr: divisions clés

source: Key sharing or splitting, also known as secret sharing, refers to a cryptographic technique where a secret (such as a cryptographic key) is divided into multiple parts, or shares, and distributed among participants.
fr: Le partage ou fractionnement de clé, également appelé partage de secret, fait référence à un technique cryptographique où un secret (tel qu'une clé cryptographique) estdivisé en plusieurs parties, ou parts, et distribuées entre les participants.

source: The key idea behind this process is that no single share reveals enough information to reconstruct the original secret. This app supports the following schemes for key sharing:
fr: L'idée clé derrière ce processus est qu'aucune action n'en révèle suffisammentinformations pour reconstruire le secret original. Cette application prend en charge schémas suivants pour le partage de clés :

source: Shamir's Secrets Sharing
fr: Séparation secrète de Shamir (SSS)

source: This app only supports splitting
fr: Cette application prend uniquement en charge le fractionnement

source: keys using Shamir's secret sharing. The key can be broken into n shares and a minimum of m shares (m < n) otherwise known as the threshold is required for key reconstruction.
fr: clés utilisant le partage secret de Shamir. La clé peut être divisée en n partages et un minimum de m actions (m < n) autrement appelé seuil est requispour la reconstruction clé.

source: Xor-based Key Splitting
fr: Fractionnement de clé basé sur Xor

source: A much simpler approach than Shamir is using the XOR or bitwise operation to split a secret. All the shares are required to reconstruct the secret.
fr: Une approche beaucoup plus simple que Shamir consiste à utiliser le XOR ou l'opération au niveau du bit pourPartagez un secret. Toutes les actions sont nécessaires pour reconstruire le secret.

source: The assumption is the key shares are also expected to remain secret. Consequently, every key splitting operation requires PGP public files to be uploaded. The number of files to be uploaded must be the same number as that of the shares to be created.
fr: L'hypothèse est que les actions clés devraient également rester secrètes.Par conséquent, chaque opération de fractionnement de clé nécessite que les fichiers publics PGP soient téléchargé. Le nombre de fichiers à télécharger doit être le même que celui des actions à créer.

source: Key reconstruction operations require only a single PGP file to be uploaded.
fr: Les opérations de reconstruction de clé nécessitent le téléchargement d’un seul fichier PGP.

source: This app only accepts PGP public key files that are in the
fr: Cette application accepte uniquement les fichiers de clé publique PGP qui se trouvent dans le

source: ASCII armored format
fr: Format blindé ASCII

source: i.e. the contents of each public key file must have the begin and end headers of
fr: c'est-à-dire que le contenu de chaque fichier de clé publique doit avoir le début et la finen-têtes de

source: respectively.
fr: respectivement.

source: Get Started
fr: Commencer

source: SECURITY OFFICER
fr: AGENT DE SÉCURITÉ

source: ENTER KEY
fr: ENTRER LA TOUCHE

source: Token Type
fr: Type de jeton

source: Token
fr: Jeton

source: A Sample Key Ceremony
fr: Un exemple de cérémonie de remise des clés

source: Secure generation and protection of four keys e.g. keys used in wireless networks:
fr: Génération et protection sécurisées de quatre clés, par exemple des clés utilisées dans les systèmes sans fil :

source: - Tuak TOP and Transport Keys
fr: - Tuak TOP et clés de transport

source: - Milenage OP and Transport Keys
fr: - Milenage OP et clés de transport

source: We assume the following requirements:
fr: Nous supposons les exigences suivantes :

source: Three SIM Provider Public Keys
fr: Trois clés publiques du fournisseur SIM

source: The PGP public keys for the SIM provider are required to encrypt the 3 XOR key shares generated for each wireless keys. The provider will reconstruct each key after decypting the shares with their private keys.
fr: Les clés publiques PGP du fournisseur SIM sont nécessaires pour chiffrer les 3 XORparts de clés générés pour chaque clé sans fil. Le fournisseur reconstruira chaque clé après avoir déchiffré les partages avec leurs clés privées.

source: Five Security Officer Public Keys
fr: Trois clés publiques du fournisseur SIM

source: A unique 128-bit wrap key is generated for each wireless key. The wrap key is used to wrap/encrypt its associated wireless key. Each wrap key is then split into 5 shares using
fr: Une clé d'enveloppement unique de 128 bits est générée pour chaque clé sans fil. La clé d'enveloppementest utilisé pour envelopper/chiffrer sa clé sans fil associée. Chaque clé d'enveloppement est alors divisé en 5 parts en utilisant

source: Shamir Secret Splitting (SSS)
fr: Séparation secrète de Shamir (SSS)

source: . Each of these shares will be encrypted with a PGP public key belonging to a security officer. Three security officers will be required to reconstruct this wrap key which in turn can be used to decrypt its wireless key.
fr: . Chacun de ces partages sera chiffré avec une clé publique PGP appartenant à un agent de sécurité. Trois agents de sécurité seront nécessaires pour reconstruirecette clé d'enveloppement qui peut à son tour être utilisée pour déchiffrer sa clé sans fil.

source: Two Yubikey Public Keys
fr: Deux clés publiques Yubikey

source: These are the backup/fallback keys that will be used to protect/encrypt the wireless keys. In the event that the number of available Security Officers do not meet the threshold to decrypt the key, this will be used for decryption. Each Yubikey and its encrypted artifacts will be stored in a safety deposit box in two different locations.
fr: Ce sont les clés de sauvegarde/de secours qui seront utilisées pour protéger/chiffrer le clés sans fil. Dans le cas où le nombre d'agents de sécurité disponibles n'atteignez pas le seuil pour déchiffrer la clé, celle-ci sera utilisée pour décryptage. Chaque Yubikey et ses artefacts cryptés seront stockés dans un coffre-fort à deux endroits différents.

source: Two Public Keys for Milenage
fr: Deux clés publiques pour Milenage

source: The milenage key will be entered at the terminal of the network provider. To mitigate the risk of both milenage keys been known by a single resource, two public keys belonging to two different resources will be provided. One to encrypt the milenage Transport key and the other to encrypt the milenage OP key.
fr: La clé milenage sera saisie sur le terminal du fournisseur de réseau. Pour Atténuer le risque que les deux clés milenage soient connues par une seule ressource, deuxdes clés publiques appartenant à deux ressources différentes seront fournies. Une à chiffrer la clé de transport du milenage et l'autre pour chiffrer OP du milenageclé.

source: and
fr: et

source: Security Officers Keys
fr: Clés des agents de sécurité

source: Provider Keys
fr: Clés du fournisseur

source: Yubikey Fallback Keys
fr: Clés de secours Yubikey

source: Wrapped Key
fr: Clé enveloppée

source: Milenage Key
fr: Clé Milenage
