Repository: layidavids/gh-actions-course
Catalog: cyph3r/locale/*/LC_MESSAGES/django.po
Languages: fr

source: size must be less than 5KB.
fr: la taille doit être inférieure à 5 Ko.

source: This is not a PGP public key
fr: Ce n'est pas une clé publique PGP

source: This is not PGP ASCII armored.
fr: Ce n'est pas du PGP ASCII blindé.

source: Upload {count} PGP public keys.
fr: Téléchargez {count} clés publiques PGP.

source: Invalid Name for GCP Resource.
fr: Nom non valide pour la ressource GCP.

source: Value must be a hexadecimal string.
fr: La valeur doit être une chaîne hexadécimale.

source: Value must be either 128 | 192 | 256 bits.
fr: La valeur doit être soit 128 | 192 | 256 bits.

source: Value must be 96 bits.
fr: La valeur doit être de 96 bits.

source: Key Identifier
fr: Identificateur de clé

source: Enter a unique key identifier.
fr: Entrez un identifiant de clé unique.

source: Transport Key
fr: Clé de transport

source: Operator (OP) Key
fr: Clé opérateur (OP)

source: Key Type
fr: Type de clé

source: Select the key type.
fr: Sélectionnez le type de clé.

source: Protocol
fr: Protocole

source: Select the protocol.
fr: Sélectionnez le protocole.

source: Key Size
fr: Taille de clé

source: Select the key size.
fr: Sélectionnez la taille de la clé.

source: The Milenage protocol only supports 128-bit OP keys.
fr: Le protocole Milenage ne prend en charge que les clés OP de 128 bits.

source: GCP Project ID
fr: ID du projet GCP

source: Project ID to store secrets and access KMS key
fr: ID de projet pour stocker les secrets et accéder à la clé KMS

source: KMS Keyring
fr: Porte-clés KMS

source: GCP KMS key ring name
fr: Nom du trousseau de clés GCP KMS

source: KMS Key
fr: Clé KMS

source: GCP KMS key name
fr: Nom de la clé GCP KMS

source: Security Officers Public Keys
fr: Clés publiques des agents de sécurité

source: Upload 5 PGP Public keys for 3 of 5 shamir secret sharing
fr: Téléchargez 5 clés publiques PGP pour 3 des 5 partages secrets Shamir

source: Provider Public Keys
fr: Clés publiques du fournisseur

source: Upload 3 Provider PGP Public keys
fr: Télécharger 3 clés publiques PGP du fournisseur

source: Fallback Public Keys
fr: Clés publiques de secours

source: Upload 2 Yubikey PGP Public keys
fr: Téléchargez 2 clés publiques Yubikey PGP

source: Milenage Public Key
fr: Clé publique Milenage

source: Upload PGP public key to wrap milenage keys
fr: Téléchargez la clé publique PGP pour envelopper les clés de milenage

source: Cloud Storage
fr: Stockage en nuage

source: Store encrypted secrets in GCP Storage Bucket
fr: Stocker les secrets chiffrés dans le bucket de stockage GCP

source: Key Index
fr: Index clé

source: Shamir key index.
fr: Index des clés Shamir.

source: Key Share (HEXADECIMAL STRING)
fr: Partage de clé (CHAÎNE HEXADÉCIMALE)

source: Enter 128 or 256 (only xor) bit key.
fr: Entrez la clé de bits 128 ou 256 (uniquement xor).

source: Select a scheme
fr: Sélectionnez un schéma

source: Scheme
fr: Schème

source: Select a Task
fr: Sélectionnez une tâche

source: Split Key
fr: Clé partagée

source: Reconstruct Key
fr: Clé de reconstruction

source: Task
fr: Tâche

source: Share Count
fr: Nombre de partages

source: Total number of key shares.
fr: Nombre total d'actions clés.

source: Threshold Count
fr: Nombre de seuils

source: Minimum number of key shares for key reconstruction.
fr: Nombre minimum de partages de clés pour la reconstruction de clé.

source: PGP Encrypt
fr: Chiffrement PGP

source: Key Share Public Keys
fr: Clés publiques de partage de clés

source: Upload PGP Public key(s)
fr: Télécharger la ou les clés publiques PGP

source: Threshold count is required for Shamir Secret Shares.
fr: Un décompte de seuil est requis pour les actions secrètes Shamir.

source: Share count is required for Shamir Secret Shares.
fr: Le décompte des partages est requis pour les partages secrets Shamir.

source: Threshold count must be less than or equal to the share count.
fr: Le nombre de seuils doit être inférieur ou égal au nombre de partages.

source: Share count is required for XOR key shares.
fr: Le nombre de partages est requis pour les partages de clés XOR.

source: Total number of public key files must be equal to the share count.
fr: Le nombre total de fichiers de clé publique doit être égal au nombre de partages.

source: Only one PGP Public key file is required for reconstruction.
fr: Un seul fichier de clé publique PGP est requis pour la reconstruction.

source: AEAD Scheme
fr: AEAD Schème

source: Encrypt
fr: Chiffrer

source: Decrypt
fr: Décrypter

source: Operation
fr: Opération

source: Key
fr: Clé

source: Encryption | Decryption Key.
fr: Cryptage | Clé de décryptage

source: ADDITIONAL AUTHENTICATED DATA (AAD)
fr: DONNÉES AUTHENTIFIÉES SUPPLÉMENTAIRES (AAD)

source: 12 bytes Nonce (Hex)
fr: 12 octets Nonce (Hex)

source: CIPHERTEXT (HEX)
fr: TEXTE CHIFFRÉ (HEX)

source: PLAINTEXT
fr: TEXTE DE PLAINTE

source: Encrypt output with PGP public key.
fr: Chiffrez la sortie avec la clé publique PGP.

source: name
fr: nom

source: Identifier for PGP encrypted file.
fr: Identifiant du fichier chiffré PGP

source: PGP Public Key
fr: Clé publique PGP

source: Upload PGP Public key to encrypt output
fr: Téléchargez la clé publique PGP pour chiffrer la sortie

source: Provide a name and upload a public key.
fr: Fournissez un nom et téléchargez une clé publique.

source: Upload a public key.
fr: Télécharger une clé publique

source: Provide a name.
fr: Donnez un nom.

source: ChaCha20-Poly1305 supports only 256 bit keys.
fr: ChaCha20-Poly1305 ne prend en charge que les clés de 256 bits.

source: KEY
fr: CLÉ

source: PASSWORD
fr: MOT DE PASSE

source: URL STRINGS
fr: CHAÎNES D'URL

source: What would you like to generate?
fr: Que souhaiteriez-vous générer?

source: Password Length
fr: Longueur du mot de passe

source: Token Length
fr: Longueur du jeton

source: At least one of uppercase, lowercase, digits, or special characters must be selected.
fr: Au moins un des caractères majuscules, minuscules, chiffres ou spéciaux doit être choisi.

source: Token length is required.
fr: La longueur du jeton est requise.
